Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །བཅུ་གཅིག་པ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་སྔ་མ་དེ་དག་ཉིད་དང་ལྡན་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེས་ཏེ། ས་དང་པོ་ཐོབ་པར་བྱས་ནས་འཕྲལ་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་ཞུགས་ཏེ་ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་བྱེད་དོ།
en: Eleventh. Endowed with just those previously mentioned bodhisattva qualities they take birth in a purified buddhafield, reach the first level, immediately enter into “the secure state” of a bodhisattva and reach the irreversible level.

source: །བཅུ་གཉིས་པ་དག་ནི་ཡོན་ཏན་དེ་དག་ཉིད་དང་ལྡན་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་སྟོབས་བསྐྱེད་པས་བདག་ཉིད་ཡོན་ཏན་རྣམས་ཀྱིས་སེམས་ཀྱི་རྒྱུད་ཡོངས་སུ་དག་པར་བྱས་ནས། རྩོལ་བ་ཆུང་ངུས་ས་དང་པོ་ཐོབ་པར་བྱས་ནས།
en: Twelfth. Endowed with just those qualities, because of the power generated by a buddhafield, their own personal good qualities purify their mindstream and they reach the first level with little effort.

source: དེ་མ་ཐག་ཏུ་ཆེན་པོ་འབད་མི་དགོས་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ཏེ་དུས་ཇི་སྲིད་ཡོད་ཀྱི་བར་དུ་བསྟན་པ་གནས་པར་བྱེད་དོ།
en: Right after that, without having to work hard, they become fully awakened and turn the wheel of the Dharma, causing the teaching to flourish for as long as they exist.

source: །བཅུ་གསུམ་པ་དག་ནི་ཡོན་ཏན་དེ་དག་ཉིད་དང་ལྡན་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེས་ནས་རྩོལ་བ་ཆུང་ངུས་ས་དང་པོ་ཐོབ་པར་བྱས་ཏེ། ས་གོང་མ་རྣམས་མ་སྐྱེས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣལ་འབྱོར་ཐམས་ཅད་ལ་སྙོམས་པར་ཞུགས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་བྱེད་དོ།
en: Thirteenth. Endowed with just those qualities they take birth in a purified buddhafield, reach the first level with little effort, and having done so, without taking birth on the higher levels become absorbed in all the yogic practices of the perfection of wisdom and in order to purify a buddhafield they take birth in buddhafield after buddhafield.

source: །བཅུ་བཞི་པ་དག་ནི་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཐོད་རྒལ་དུ་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་བཞག་ནས་སྙོམས་པར་འཇུག་པ་དེ་རྣམས་ཀྱིས་གནས་པར་བྱེད་དོ།
en: Fourteenth. They dwell in the nonconceptual perfection of wisdom and, having become absorbed in the viṣkandaka absorption, keep dwelling on account of those absorptions.

source: །བཅོ་ལྔ་པ་དག་ནི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་།
en: Fifteenth.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་ལྡན་ཞིང་། ཡོངས་སུ་འདྲིས་པའི་ཤེས་པས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་སོགས་པ་ཡོངས་སུ་ཤེས་པར་བྱས་ཀྱང་དེ་དག་མངོན་སུམ་དུ་མི་བྱེད་པར་གཞན་དག་ཀྱང་ལམ་དང་འབྲས་བུ་དེ་དག་ལ་སོ་སོར་འགོད་དོ།
en: Endowed with the dharmas on the side of awakening and endowed with the buddhadharmas, they thoroughly understand the results of stream enterer and so on with their knowledge of mastery, but, without actualizing them, establish others in those paths and results.

source: །ཡོངས་སུ་དྲིས་པའི་ཤེས་པ་དེ་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་དམ་པ་ཞེས་བྱའོ།
en: Just that “knowledge” of mastery “is a bodhisattva [great being’s]” supreme “forbearance.”

source: །བཅུ་དྲུག་པ་དག་ནི་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཏེ།
en: Sixteenth.

source: གང་བསྐལ་པ་འདི་ཉིད་ལ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་དག་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས་ནས་དགའ་ལྡན་གྱི་གནས་སྦྱོང་བར་བྱེད་དོ།
en: They are bodhisattvas of the Fortunate Eon who, having become fully awakened in this very eon, dwell in the nonconceptual perfection of wisdom and purify the Tuṣita abode.

source: །བཅུ་བདུན་པ་དག་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་སྟེ།
en: Seventeenth.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་ལྡན་ཞིང་། ཡོངས་སུ་འདྲིས་པའི་ཤེས་པས་འཕགས་པའི་བདེན་པ་རྣམས་ཚོལ་བ་ལ་གནས་སོ།
en: They are bodhisattvas obstructed by just a single birth who are endowed with all śrāvaka, pratyekabuddha, and buddha dharmas, and with their knowledge of mastery remain searching for the noble truths.

source: །བཅོ་བརྒྱད་པ་དག་ནི་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་བརྒྱ་སྟོང་མང་པོས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་བྱས་ནས་སེམས་ཅན་གྱི་དོན་བྱ་བ་ལ་བརྩོན་པར་གནས་ཏེ། དཔེར་ན་འཕགས་པ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སོགས་པ་ལྟ་བུའོ།
en: Eighteenth. They become fully awakened over the course of many hundred thousands of one hundred million incalculable eons and keep on endeavoring at working for the welfare of beings, like, for example, Mañjuśrī Kumārabhūta.

source: །བཅུ་དགུ་པ་དག་ནི་དེ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ལ་བརྟུན་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་འཆད་ཅིང་གནས་སོ།
en: Nineteenth. Similarly, they have strived to fully awaken and remain explaining the doctrine to beings.

source: །ཉི་ཤུ་པ་དག་ནི་དེ་བཞིན་དུ་སེམས་ཅན་གྱི་དོན་བྱེད་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་གནས་སོ།
en: Twentieth. Similarly, working for the welfare of beings they dwell in buddhafield after buddhafield.

source: །ཉི་ཤུ་གཅིག་པ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཀྱང་སྦྱིན་པ་ཉིད་ཀྱིས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་ཏེ་སེམས་ཅན་རྣམས་སྦྱིན་པ་ཉིད་ལ་འགོད་དོ།
en: Twenty-first. They stand in the six perfections, and with their generosity they also satisfy beings and establish beings in generosity.

source: །ཉི་ཤུ་གཉིས་པ་དག་ནི་ཚུལ་ཁྲིམས་ཀྱིས་བསྡུས་ཏེ། ཚུལ་ཁྲིམས་ལ་འགོད་དོ།
en: Twenty-second. With morality they gather beings together and establish them in morality.

source: །ཉི་ཤུ་གསུམ་པ་དག་ནི་བཟོད་པ་ལ་འགོད་དོ།
en: Twenty-third. They establish beings in patience.

source: །ཉི་ཤུ་བཞི་པ་དག་ནི་བརྩོན་འགྲུས་ལ་འགོད་དོ།
en: Twenty-fourth. They establish beings in perseverance.

source: །ཉི་ཤུ་ལྔ་པ་དག་ནི་བསམ་གཏན་ལ་འགོད་དོ།
en: Twenty-fifth. They establish beings in concentration.

source: །ཉི་ཤུ་དྲུག་པ་དག་ནི་ཤེས་རབ་ལ་འགོད་དོ།
en: Twenty-sixth. They establish beings in wisdom.

source: །ཉི་ཤུ་བདུན་པ་དག་ནི་སངས་རྒྱས་ཀྱི་ཆ་བྱད་ཀྱིས་ཤར་ཕྱོགས་ཀྱི་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ།
en: Twenty-seventh.

source: དེར་སངས་རྒྱས་མཉེས་པར་བྱ་བ་ལྷུར་བླངས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་མཐོང་བའི་ཡོན་ཏན་རྣམས་བཟུང་སྟེ། བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Disguised as buddhas they bring beings in the eastern direction to maturity, focus on pleasing the buddhas, apprehend the good qualities they see in that buddhafield, and, having purified their own buddhafield, reside there obstructed by just a single birth.

source: །ཉི་ཤུ་བརྒྱད་པ་དག་ནི་ལྷོ་ཕྱོགས་སུ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དགོད་ཅིང་གནས་སོ།
en: Twenty-eighth. Similarly, they reside establishing the buddhafield in the south.

source: །ཉི་ཤུ་དགུ་པ་དག་ནི་ནུབ་ཕྱོགས་སུའོ། །སུམ་ཅུ་པ་དག་ནི་བྱང་ཕྱོགས་སུའོ།
en: Twenty-ninth are those in the west. Thirtieth are those in the north.

source: །སུམ་ཅུ་གཅིག་པ་དག་ནི་བྱང་ཤར་གྱི་མཚམས་སུའོ།
en: Thirty-first are those in the intermediate direction to the northeast.

source: །སུམ་ཅུ་གཉིས་པ་དག་ནི་ཤར་ལྷོའི་མཚམས་སུའོ།
en: Thirty-second are those in the intermediate direction to the southeast.

source: །སུམ་ཅུ་གསུམ་པ་དག་ནི་ལྷོ་ནུབ་ཀྱི་མཚམས་སུའོ།
en: Thirty-third are those in the intermediate direction to the southwest.

source: །སུམ་ཅུ་བཞི་པ་དག་ནི་ནུབ་བྱང་གི་མཚམས་སུའོ།
en: Thirty-fourth are those in the intermediate direction to the northwest.

source: །སུམ་ཅུ་ལྔ་པ་དག་ནི་འོག་གི་ཕྱོགས་སུའོ།
en: Thirty-fifth are those in the direction below.

source: །སུམ་ཅུ་དྲུག་པ་དག་ནི་སྟེང་གི་ཕྱོགས་སུའོ།
en: Thirty-sixth are those in the direction above.

source: །སུམ་ཅུ་བདུན་པ་དག་ནི་ཕྱོགས་བཅུའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ནས།
en: Thirty-seventh.

source: ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་ལ་བསྙེན་བཀུར་བྱས་ཏེ། དེ་ནས་མཐོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་ཁྱད་པར་རྣམས་བཟུང་ནས་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བསྒྲུབས་ཏེ་དེ་ན་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པར་གནས་སོ།
en: They bring beings in the ten directions to maturity, please the buddhas of the ten directions, apprehend the special qualities they see in those buddhafields, and, having perfected their own buddhafield, abide there obstructed by just a single birth.

source: །སུམ་ཅུ་བརྒྱད་པ་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དང་ལྡན་ཞིང་།
en: Thirty-eighth.

source: སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས་སངས་རྒྱས་ཀྱི་ཆ་བྱད་དུ་རྣམ་པར་སྤྲུལ་པ་ཆེན་པོ་དང་། སྤྱོད་ལམ་ཞི་བ་དང་། དབང་པོ་གསལ་བ་དང་། སྐྱེ་བོ་མང་པོ་དགའ་བར་བྱས་ནས།
en: They are endowed with all the buddhadharmas and, through the force of earlier prayers that are vows, disguised as a buddha make many beings feel joy in their great miraculous productions, calm bearing, and refined faculties.

source: དགའ་བ་དང་མགུ་བའི་མཐུ་དེ་ཉིད་ཀྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ། མཐར་གྱིས་ཐེག་པ་གསུམ་གྱི་རིམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བྱེད་དོ།
en: Just through the force of that joy and delight they bring beings to maturity, causing them finally to gradually enter into complete nirvāṇa by means of the three vehicles.

source: །སུམ་བཅུ་དགུ་པ་དག་ནི་དབང་པོ་གསལ་བ་དེ་དག་ཉིད་དང་ལྡན་ཞིང་དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ཀྱང་བདག་ལ་སྟོད་པར་མི་བྱེད་པ་དང་། གཞན་ལ་སྨོད་པར་མི་བྱེད་པར་བཏང་སྙོམས་སུ་གནས་པས་ལྷུར་བླངས་ཏེ་གནས་སོ།
en: Thirty-ninth. Endowed with those same refined faculties, similarly, they work for the welfare of beings but do not praise themselves and disparage others, staying focused by abiding in equanimity.

source: །བཞི་བཅུ་པ་དག་ནི་ས་རབ་ཏུ་དག་པ་ལ་གནས་ཏེ།
en: Fortieth.

source: སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ནས། དབུལ་བའི་སྡུག་བསྔལ་དང་། ངན་འགྲོའི་སྡུག་བསྔལ་རྣམས་མི་མྱོང་བར་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་ཐུག་གི་བར་དུ། སེམས་ཅན་གྱི་དོན་ལྷུར་ལེན་ཅིང་གནས་སོ།
en: They stand on the Pramuditā level, stand in the perfections of giving and morality, do not experience the suffering of destitution or the suffering of terrible forms of life, and until they reach the irreversible stage stay focused on the welfare of others.

source: །བཞི་བཅུ་གཅིག་པ་དག་ནི་སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྷུར་ལེན་ཅིང་།
en: Forty-first.

source: ཚེ་རབས་ཀུན་དུ་འཁོར་ལོས་སྒྱུར་བར་གྱུར་ནས། རྫུ་འཕྲུལ་གྱི་སྟོབས་དེས་སེམས་ཅན་རྣམས་བསྡུས་ཏེ་སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་ལ་འགོད་དོ། །བཞི་བཅུ་གཉིས་པ་དག་ནི་སྦྱིན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྷུར་ལེན་ཅིང་།
en: Focusing on the perfections of giving and morality, in all their lives they become wheel-turning emperors, and, through the power of their miraculous productions, gather beings together and establish them in giving and morality. Forty-second.

source: དེ་བཞིན་དུ་ཚེ་རབས་ཀུན་དུ་འཁོར་ལོས་སྒྱུར་བར་གྱུར་ནས། རྫུ་འཕྲུལ་གྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པས་ཕྱོགས་བཅུའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་པ་དང་། མཆོད་པར་བྱེད་ཅིང་གནས་སོ།
en: Focusing on the perfections of giving and morality, similarly, in all their lives they become wheel-turning emperors and, endowed with the great force of their miraculous productions, stand pleasing and worshiping the buddhas of the ten directions.

source: །བཞི་བཅུ་གསུམ་པ་དག་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་།
en: Forty-third.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྣང་བ་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྣང་བ་ཉིད་ཀྱིས་བདག་ཉིད་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་གནས་སོ།
en: They abide in the six perfections and bring beings to maturity with all “the light of the buddhadharmas,” and with this same light of the buddhadharmas cause themselves personally to mature, remaining “up until they… fully awaken.”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བསྟན་ནས། ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་ཡང་དག་པར་བྱུང་བ་ཡིན་ནོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: After having thus taught who the bodhisattvas are, it says, “This, Śāriputra, is the origination of the bodhisattva great beings in the buddhadharmas.”

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མྱུ་གུ་སངས་རྒྱས་ཀྱི་ཆོས་ལ་འཕེལ་བའི་རིམ་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The meaning is that this is the sequence in the growth of the buddhadharmas that are the shoots of bodhisattvas.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་པའི་སྐབས་དབྱེ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཚད་མར་མཛད་དེ། ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་ལས་རྣམས་ཀྱི་གོ་མི་དབྱེའོ་ཞེས་གསུངས་སོ།
en: Then, to begin the explanation, the Lord, taking those bodhisattvas as the measure, says, “Therefore, Śāriputra, bodhisattva great beings practicing the perfection of wisdom would provide no opportunity for basic immoral physical, verbal, and mental action.”

source: །གནས་བརྟན་ཉིད་ཀྱིས་དེ་ཉིད་བཟུང་སྟེ།
en: Taking his cue from that, to begin the explanation the elder [Śāriputra] himself then asks, “What, Lord, is a bodhisattva great being’s basic immoral physical action?”

source: བཤད་པའི་སྐབས་དབྱེ་བའི་ཕྱིར།
en: and so on.

source: བཅོམ་ལྡན་འདས་ལུས་ཀྱི་ལས་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་གང་ལགས་ཞེས་བྱ་བ་ལ་སོགས་པ་ཞུས་སོ། །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱིས་ལུས་དང་ངག་དང་ཡིད་དུ་དམིགས་པའི་འདུ་ཤེས་པ་བཀའ་མ་སྩལ་བར་ལུས་གང་གིས་ལུས་ཀྱི་ལས་བརྩམ་པར་བྱའོ། །ངག་གང་དང་ཡིད་གང་གིས་ལས་བརྩམ་པར་བྱ་སྙམ་དུ་སེམས་ན། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྩོམ་པའི་སྐྱོན་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: Then the Lord, talking about the perception that apprehends a body, a voice, and a thinking mind, teaches that if it occurs to a bodhisattva to think, “This is the body with which I should undertake physical action, this is the voice, this is the thinking mind with which I should undertake the action,” then there is a fault in their undertaking.

source: །དེ་དག་ཉིད་ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་ཡིན་ནོ།
en: Just those are the physical, verbal, and mental bases of suffering.

source: །འདི་ལྟར་ལུས་དང་ངག་དང་ཡིད་མི་དམིགས་པས་མི་དམིགས་པ་འདི་ཉིད་གནས་ངན་ལེན་སྦྱོང་བ་ཡིན་ནོ་ཞེས་བསྟན་ནས། དེའི་འོག་ཏུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ས་རབ་ཏུ་དགའ་བ་ལ་གནས་ནས་ཀྱང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ལ་རྗེས་སུ་སྤྱོད་ཅིང་། ཉན་ཐོས་ཀྱི་སེམས་དང་རང་སངས་རྒྱས་ཀྱི་སེམས་ཡོངས་སུ་སྤངས་ནས་དུས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཉེ་བར་གནས་ཏེ། དེ་ལྟ་བུས་ཀྱང་གནས་ངན་ལེན་སྦྱངས་པར་འགྱུར་རོ་ཞེས་བསྟན་ཏོ།
en: Having thus taught that it is this nonapprehending body, voice, and thinking mind itself that cleanses the bases of suffering, it then teaches that also bodhisattvas standing on the Pramuditā level, if, practicing the ten wholesome actions, stop śrāvaka thought and pratyekabuddha thought and constantly attend to a greatly compassionate thought for all beings, then in that case too they would have thoroughly cleansed the bases of suffering.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ལམ་གང་ལགས་ཞེས་བྱ་བ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཐ་མི་དད་པར་བརྗོད་པའི་ཕྱིར་ཞུས་པའོ།
en: Śāriputra asks, “What, Lord, is the bodhisattva great beings’ awakening path?” because “cleansing the awakening path” presented it as not different from the perfections.

source: །དེའི་འོག་ཏུ་ཤཱ་རིའི་བུ་བྱང་ཆུབ་ཀྱི་ལམ་གང་ལ་སྤྱོད་ན་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་མི་དམིགས་པའི་རྣལ་འབྱོར་བྱང་ཆུབ་ཀྱི་ལམ་གང་ཡིན་པར་སྟོན་ཏོ།
en: Then, “Śāriputra, when bodhisattva great beings practice the awakening path,” and so on, teaches that the awakening path is a yogic practice that does not apprehend anything.

source: །དེ་ནས་ཡང་བར་སྐབས་སུ་བྱང་ཆུབ་ཀྱི་ལམ་རྣམ་པ་གཉིས་བསྟན་ཏེ། མི་དམིགས་པར་སྦྱོར་བ་དང་། རློམ་སེམས་མེད་པར་སྦྱོར་བའོ།
en: Then, in a subsection, it teaches the two parts of the awakening path: practice that does not apprehend anything and practice that does not falsely project anything.

source: །འགྲེས་དེ་གཉིས་ནི་མི་དམིགས་པས་རློམ་སེམས་མེད་པའི་ཕྱིར་སྦྱོར་བ་གོང་མ་ནི་སྦྱོར་བ་ཕྱི་མའི་རྒྱུ་ཡིན་ནོ།
en: As for those two connected sections, the earlier practice is the cause of the later practice because, when they do not apprehend anything, they do not falsely project anything.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱི་ཡིན་གྱི། བྱང་ཆུབ་སེམས་དཔའི་མ་ཡིན་ནོ་སྙམ་དུ་བསམས་ནས། གནས་བརྟན་གྱིས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་གང་ལགས་ཞེས་ཞུས་པ་དང་།
en: The elder [Śāriputra], thinking that just a tathāgata has the knowledge of a knower of all aspects, and a bodhisattva does not, asks, “What, Lord, is the bodhisattva great beings’ knowledge of a knower of all aspects?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡེ་ཤེས་དེ་དང་ལྡན་པ་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་ས་བརྒྱད་པ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་དེ་ལྟ་བུ་སྐྱེ་བ་དེ་ནི་རང་བཞིན་ཡིན་ཏེ་རྣམ་པར་སྨིན་པའི་ཡེ་ཤེས་སོ་ཞེས་བསྟན་ཏོ།
en: And the Lord, with “in possession of that knowledge,” and so on, says that the type of bodhisattva knowledge produced on the eighth level is a natural knowledge, which is to say, a matured knowledge.

source: །རྣམ་པར་སྨིན་པའི་ཡེ་ཤེས་ཀྱིས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སོགས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཀྱང་། དེ་དག་ལ་རྩོལ་བའི་ཡིད་ལ་བྱེད་པ་མི་འབྱུང་སྟེ།
en: The matured knowledge brings all the perfections and so on to completion, but still the attention to making an effort at them is not there.

source: ཡེ་ཤེས་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱུ་ཡིན་པའི་ཕྱིར། རྒྱུ་ལ་འབྲས་བུ་བཏགས་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཞེས་བྱའོ།
en: It is therefore called the knowledge of a knower of all aspects, having labeled the cause with the name of the result, because that knowledge is the cause of the knowledge of all aspects.

source: །དེའི་འོག་ཏུ་གཟུགས་ཐམས་ཅད་ལ་འཇུག་པའི་ཤེས་པ་ནི་ཤའི་མིག་གོ། །ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཤེས་པ་ནི་ལྷའི་མིག་གོ། །ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ནི་ཤེས་རབ་ཀྱི་མིག་གོ། །གནས་དང་གནས་མ་ཡིན་པ་མཁྱེན་པ་མ་གཏོགས་པའི་ཤེས་པ་དགུ་པོ་དག་ནི་ཆོས་ཀྱི་མིག་གོ།
en: Then the “flesh eye” is the knowledge that engages with all forms; the “divine eye” knows all meditative stabilizations and absorptions; the “wisdom eye” is knowledge of all-knowledge; the “dharma eye” is all nine knowledges with the exception of the knowledge of what can and cannot be; and the “buddha eye” is knowledge of the vajropama meditative stabilization.

source: །རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་ནི་སངས་རྒྱས་ཀྱི་སྤྱན་ཡིན་ནོ་ཞེས་དེ་དག་གི་རྣམ་པར་དབྱེ་བ་བསྟན་ཏོ།
en: It teaches their division in that way.

source: །དེའི་འོག་ཏུ་མངོན་པར་ཤེས་པས་གནས་པ་ལ། མངོན་པར་ཤེས་པས་ཐམས་ཅད་ལ་ཡང་། སྔར་ཀུན་རྫོབ་ཀྱི་ཤེས་པས་མངོན་པར་ཤེས་པ་ལ་གནས་པ་བསྟན་ནས། ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ་ཡིན་པར་བསྟན་པའི་ཕྱིར་ཕྱིས་དོན་དམ་པའི་ཤེས་པས་རྣམ་པར་མི་རྟོག་པ་ཡིན་པར་བསྟན་ཏོ།
en: Then, in regard to abiding with the clairvoyances, for all the clairvoyances it gives an earlier explanation of abiding with the clairvoyances as conventional knowledge, and afterward, to teach that they are absolutely complete, it teaches that as ultimate knowledge they are nonconceptual.

source: །ཤིན་ཏུ་རྣམ་པར་དག་པ་ཉིད་དུ་བསྟན་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གནས་པ་ཐམས་ཅད་ཀྱང་ཀུན་རྫོབ་ཀྱི་ཤེས་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། ཕྱིས་དོན་དམ་པར་མི་དམིགས་པར་བྱེད་དེ།
en: To teach that they are absolute purity, conventional knowledge, having made all the abiding of bodhisattvas complete, afterward ultimately does not apprehend them and on account of that becomes absolutely “perfected” and absolutely “purified.”

source: དེའི་ཕྱིར་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པ་དང་། ཤིན་ཏུ་རྣམ་པར་དག་པར་འགྱུར་རོ། །དེ་བས་ན་ཐམས་ཅད་ཀྱི་ཐ་མར་ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མངོན་པར་ཤེས་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་ཡོངས་སུ་དག་པར་བྱེད་དེ། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་དག་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore at the end it says, “Śāriputra, practicing the perfection of wisdom like that the six clairvoyances of bodhisattva great beings are perfected and purified, and those purified clairvoyances cause them to gain the knowledge of all aspects.” “

source: །དེས་གང་གིས་རློམ་སེམས་སུ་འགྱུར་ཞེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་གྱིས་སོ།
en: They do not apprehend a false projection of miraculous power,” by a miraculous power. “

source: །གང་རློམ་སེམས་སུ་བྱེད་ཅེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་བྱ་བའི་ཆོ་གའོ། །གང་གིས་རློམ་སེམས་སུ་བྱེད་ཅེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་སྟེ། དེས་རྫུ་འཕྲུལ་དེ་དག་མི་དམིགས་སོ།
en: What they might falsely project,” a procedure that is the activity of miraculous power, “or what might be falsely projecting,” knowledge of the activity of miraculous power— “they do not apprehend” those miraculous powers. “

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱ་བ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དོ། །རང་བཞིན་དབེན་པ་ཞེས་བྱ་བ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཉིད་དོ། །རང་བཞིན་གྱིས་མ་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་པའི་ངོ་བོ་ཉིད་དོ།
en: Its intrinsic nature is empty” is the nonexistence of its intrinsic nature; “its intrinsic nature is isolated” is absolute purity; and “its intrinsic nature is not produced” is the intrinsic nature of a compounded phenomenon. “

source: །དེ་རྫུ་འཕྲུལ་དུ་སེམས་པ་ཡང་མི་བསྐྱེད་དོ་ཞེས་བྱ་བ་ནི་དེ་ནི་རྫུ་འཕྲུལ་ཡིན་ནོ་སྙམ་དུ་སེམས་པ་དང་། རྫུ་འཕྲུལ་མངོན་པར་སྒྲུབ་པར་སེམས་པའོ་ཞེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་འདི་དག་མངོན་པར་བསྒྲུབ་པར་བྱའོ་སྙམ་དུ་སེམས་པའོ།
en: They do not intend miraculous power” is the intention that thinks, “That is miraculous power”; “[they] intend to accomplish miraculous power” is the intention that thinks, “I am going to accomplish these miraculous powers.” “

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གང་དག་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱིས་ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཕྱིར།སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ།
en: Therefore, Śāriputra, there are bodhisattva great beings practicing the perfection of wisdom who, standing in the perfection of giving, cleanse the path to the knowledge of all aspects based on not holding on to anything because of the emptiness that transcends limits.”

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བ་དག་ཀྱང་ཡོད་དོ་ཞེས་བྱ་བས་ནི་རྣམ་པར་མི་རྟོག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅར་ལ་གནས་ཀྱང་རུང་ཕ་རོལ་ཏུ་ཕྱིན་པ་རེ་རེ་ལ་གནས་ཀྱང་རུང་སྟེ། བྱང་ཆུབ་ཀྱི་ལམ་སྦྱོང་བར་བྱེད་དོ།
en: Whether they abide in all six of the nonconceptual perfections, or whether they abide in any one of the six perfections, they cleanse the awakening path. “

source: །ཤཱ་རིའི་བུ་ཡོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་དེ་དག་གི་མོས་པ་ཐ་དད་པ་བསྟན་ཏོ།
en: Śāriputra, there are…,” and so on, teaches their different inclinations. “

source: །མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བས་ནི་སྒྲོ་འདོགས་པ་དང་། སྐུར་པ་འདེབས་པའི་མཐའ་སྤངས་སོ།
en: Because of the emptiness that transcends limits”— the extreme of over-reification and the extreme of over-negation have stopped. “

source: །ཡོངས་སུ་འཛིན་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་འཁོར་གསུམ་ལ་མངོན་པར་ཞེན་པ་མེད་དོ།
en: Based on not holding on to anything”— they do not settle down on the three spheres of giver, gift, and recipient and so on.

source: །གང་གི་ཕྱིར་དེ་འཛིན་པ་མེད་པ་ཡིན་པ་དེའི་ཕྱིར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ནས་བྱང་ཆུབ་ཀྱི་ལམ་ལ་སྦྱོང་བར་བྱེད་དོ།
en: Because of not holding on to anything, they therefore, “standing in the perfection of giving, cleanse the path to” awakening. “

source: །འོང་བ་མེད་པ་དང་འགྲོ་བ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྦྱོང་བར་བྱེད་དོ་ཞེས་འབྱུང་བས། གལ་ཏེ་ལམ་ཡོད་ན་འོང་བ་དང་འགྲོ་བའི་འོས་ཀྱང་ཡོད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་པ་ལས་དགོངས་ནས། དེ་དག་མེད་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་གསུངས་ཏེ། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལས་ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་ན་ཡང་གང་ནས་ཀྱང་འོང་བ་མེད་ལ། འགག་པ་ན་ཡང་གང་དུ་ཡང་འགྲོ་བ་མེད་དོ་ཞེས་འབྱུང་བ་དང་།
en: Based on not having gone, not having come— having in mind those who think, “We have been told, ‘They cleanse the awakening path,’ so, if there is a path there must be coming and going,” it negates them, saying “based on not…” The Śrāvaka Vehicle says, “All dharmas are produced, but still they do not come from anywhere; they stop, but still they do not go anywhere.”

source: ཐེག་པ་ཆེན་པོ་ལས་སྐྱེ་བ་དང་འགག་པ་མེད་པའི་ཕྱིར་ཐེག་པ་ཆེན་པོ་ལ་འོང་བ་དང་། འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ་ཞེས་བྱའོ།
en: In the Great Vehicle it is said, “Because there is no production and stopping, there is liberation from coming and going.” “

source: །འཛིན་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་ལ་ཆོས་སུ་མངོན་པར་ཞེན་པ་ནི་ཡོངས་སུ་འཛིན་པའོ། །སྦྱིན་པ་ནི་ཡོངས་སུ་འཛིན་པ་ཡོད་པའི་ཕྱིར་ཡོངས་སུ་གདགས་སོ་ཞེས་བྱ་བ་ནི་སེར་སྣ་ཡོངས་སུ་འཛིན་པའོ།
en: And not having grasped anything”— settling down on dharmas as dharmas is holding on to something; “giving is designated based on holding on to things”— miserliness is holding on to something.

source: །སྦྱིན་པ་ནི་ཡོངས་སུ་འཛིན་པ་ཉེ་བར་བཟུང་བ་ལས་གདགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་ཅི་ལས་དགོངས་ཤེ་ན།
en: What is the intention where it says “giving is designated based on holding on to things” and so on?
